[
    {
        "name": "Andego Back Posture Corrector for Women & Men – Effective and Comfortable Posture Brace for Slouching & Hunching - Discreet Design – Posture Support",
        "price": "$18.95",
        "ratings": {
            "5 star": "49%",
            "4 star": "17%",
            "3 star": "9%",
            "2 star": "8%",
            "1 star": "17%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Well, contrary to some reviewers, I found the item to perform exactly as described. That said, I've only worn it several days (everyday since it arrived) and a.) have no problems putting it on and adjusting it. b. I've tugged hard on the straps and there has been no sign of tearing, or fraying of the straps, nor of them coming apart. Reviewers who've commented on the quality of manufacture, while their experience, can be addressed by putting it through a \"stress test\" when you first get it. If something gives, then return it. Mind you I've only had it for a week or so, but it shows no sign of a possible failure. Is it uncomfortable? No, not really. It does take getting used to as most of us don't have good posture, and we'll pay a price while the device does its thing. There is sufficient padding, and it's adjustable for under the arm/in the armpit. You can't slip it on, yank the straps and \"go.\" I open it up to the max and put it on; then arrange the pads to be ensure they'll be under the arms so I'll feel no binding or chafing and continue as I tighten down the straps to \"pull myself into the proper posture.\" Based on your size, you may have to adjust the velcro strap that positions the center back \"circle\" as noted in the picture. Will it fail me in the future? Don't know. So far, it shows no signs of product failure or stitching failure. My view, it's well made. You don't wear it all day...start with about 30 minutes and work up, to an hour or two or longer. The first few days/week it's a bit uncomfortable as it begins the journey to get your posture correct, so start slow and work to a longer duration.",
                "review_posted_date": "27 Feb 2018",
                "review_header": "Well made product - You have to take the time to fully adjust it to YOU; it's not an out of the box, just put it on and go.",
                "review_rating": "5.0 ",
                "review_author": "Marcanthony Salvatini"
            },
            {
                "review_comment_count": "",
                "review_text": "I've been trying to work on helping my posture for the last year. I've been going to a chiropractor and he tells me that I need to work on keeping my shoulders back and not hunched. I came across this posture corrector and decided to give it a try. It helps a lot. You wear it for 20-30 min a,day for the first couple days to get used to it and I could really feel it! After I took it off I found myself better remembering,to not hunch,over so much! I'm,excited to keep using this tool to help improve my posture! So happy I found it!",
                "review_posted_date": "23 Aug 2018",
                "review_header": "Don't be a slump try this!",
                "review_rating": "5.0 ",
                "review_author": "Hm247"
            },
            {
                "review_comment_count": "",
                "review_text": "I found this brace while looking for something to help with my anterior pelvic tilt.. but I also had scoliosis so I figured I would give this a try. On the first day I noticed so much popping in my upper back, my lower back felt less pressure and after removing it I felt the need to constantly correct my posture on my own. I made my husband try wearing my brace for a day (he spends a lot of time sitting) and he loved it so much he made me order him as well!",
                "review_posted_date": "22 Feb 2018",
                "review_header": "Awesome!!",
                "review_rating": "5.0 ",
                "review_author": "Sinclair11"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought this posture corrector because my back and neck seems to constantly be sore all the time. I was constantly self massaging or putting on in gay or taking hot showers or something. Then somebody mentioned that I was slouching a lot. Once I was brought to my attention I consciously tried to set up but whenever I wasn't paying attention I would tend to slouch. That's when I bought this device. I love this thing. My back straight, my shoulders back, and my neck the right way. I've noticed that in the weeks after I started why this that my back hurts way less. My neck hurts not at all. This is really helped me a whole lot. The only thing semi negative I'd want to say about it is that I had a little bit of difficulty adjusting it. You can't just pull it out of the box, put it on, and go. It takes a bit of a Justin to make sure it fits the individual. And that makes sense, doesn't it? Because not all of us are exactly the same height, weight, and size. You have to laid out and adjust the straps in the padding so if it's you specifically. So that did take me a few minutes to get it exactly right and it was a tad bit frustrating when I first started out. But it was well worth it. Absolutely completely well worth it. I feel fantastic now and I would definitely recommend this device to anybody who has any amount of back pain, neck pain shoulder pain.",
                "review_posted_date": "27 Apr 2018",
                "review_header": "Helped ease my neck/back pain",
                "review_rating": "5.0 ",
                "review_author": "Tracy M"
            },
            {
                "review_comment_count": "",
                "review_text": "Surprisingly, it has helped with my shoulder pain. Downside is that it does not fit under snuggly fitting clothes, so you won't be able to wear it with those clothes. Also, when the weather is hot, it causes you to be hotter, causing sweating and becomes damp from perspiration. Other than that, I wear it every day for the 12 hours recommended and it really does help keep my posture perfect and my shoulder pain free.",
                "review_posted_date": "28 Mar 2018",
                "review_header": "Perfect Posture and Pain Free Shoulder",
                "review_rating": "5.0 ",
                "review_author": "Barbara J. Kuehn"
            },
            {
                "review_comment_count": "",
                "review_text": "I was a cynic about this product but I have tech neck (bad posture and pain from looking at electronics) and was needing to try something. This product has taken a little getting used to, but it has REALLY made a difference in the amount of pain and discomfort I have had. My headaches decreased in intensity the first few days and have continued to improve. I know that it has helped me to improve my posture. It has motivated me to make changes in my office so that the product can have maximum effect and make a permanent impact on my body. It may seem quirky but don't disregard the positive effects it will have!",
                "review_posted_date": "18 Apr 2018",
                "review_header": "Beyond my expectations, no longer a cynic",
                "review_rating": "5.0 ",
                "review_author": "LeNeeC"
            },
            {
                "review_comment_count": "",
                "review_text": "I use a computer, notebook, iPad and iPhone 12-15 hours per day and have been struggling with “Tech Neck” for several years. This supporter relieved about 5 years of pain and discomfort in a few weeks. In noticed improvement within a week to 10 days. I was visiting a chiropractor every 3-4 weeks. Even so, I began to experience paresthesia on the right right side, and was considering taking my primary care MD’s advice to see an orthopedist or neurologist. My insurance changed and my usual chiropractor was out of network, I found a new one. He convinced me most of my discomfort was caused by posture and ergonomics. He taught me some stretches and I studied ergonomics. Mayoclinic.org led me to look for a posture correction support. I’m not “cured” and I still use this support for several hours per week, usually on Thursday, Friday or Saturday. I no longer get the pins and needles or weakness and I’m able to get to sleep without taking a Tylenol an hour before retiring.",
                "review_posted_date": "01 Sep 2018",
                "review_header": "Great for correcting “Tech Neck”",
                "review_rating": "5.0 ",
                "review_author": "Amazon Cust"
            },
            {
                "review_comment_count": "",
                "review_text": "I feel like this really straightens out my back so I gave you five stars because it does what it says. I have only used it for two days so I can't speak to long term benefits but I am hopeful.",
                "review_posted_date": "25 Feb 2018",
                "review_header": "So far so good!",
                "review_rating": "5.0 ",
                "review_author": "Kimberly Walker"
            }
        ],
        "url": "http://www.amazon.com/dp/B0776MN1XL"
    }
]